In [1]:
import sqlite3 as sql
import pandas as pd

In [2]:
conn = sql.connect('practice2.db')

In [3]:
cursor = conn.cursor()

In [4]:
info1 = [
        (1, "Paul", 32, "California", 20000.0), 
        (2, "Allen", 25, "Texas", 15000.0),    
        (3, "Teddy", 23, "Norway", 20000.0), 
        (4, "Mark", 25, "Rich-Mond", 65000.0), 
        (5, "David", 27, "Texas", 85000.0), 
        (6, "Kim", 22, "South-Hall", 45000.0), 
        (7, "james", 24, "Houston", 10000.0)
        ]

In [6]:
cursor.executemany('INSERT INTO table1 VALUES(?, ?, ?, ?, ?)', info1)

In [7]:
conn.commit()

In [8]:
info2 = [
        (1, "IT Billing", 1),
        (2, "Engineering", 2),
        (3, "Finance", 7),
        (4, "Engineering", 3),
        (5, "Finance", 4),
        (6, "Engineering", 5),
        (7, "Finance",6 ),
        ]

In [9]:
cursor.executemany('INSERT INTO table2 VALUES(?, ?, ?)', info2)

In [10]:
conn.commit()

In [19]:
df = pd.read_sql_query('SELECT * FROM table2 LEFT OUTER JOIN table1 WHERE table1.id = table2.emp_id', conn)
df

   id         dept  emp_id  id   name  age     address   salary
0   1   IT Billing       1   1   Paul   32  California  20000.0
1   2  Engineering       2   2  Allen   25       Texas  15000.0
2   4  Engineering       3   3  Teddy   23      Norway  20000.0
3   5      Finance       4   4   Mark   25   Rich-Mond  65000.0
4   6  Engineering       5   5  David   27       Texas  85000.0
5   7      Finance       6   6    Kim   22  South-Hall  45000.0

In [14]:
cursor.execute('DELETE FROM table1 WHERE id = 7')

In [15]:
conn.commit()

In [28]:
cursor.executemany('INSERT INTO table1 VALUES(?,?,?,?,?)', [(7, "James", 24, "Houston", 10000.0), (8, "Lebron", 23, "Lakers", 10000.0)])

In [29]:
conn.commit()

In [38]:
pd.read_sql_query('SELECT emp_id, name, dept FROM table1 NATURAL JOIN table2', conn)

   emp_id   name         dept
0       1   Paul   IT Billing
1       2  Allen  Engineering
2       7  Teddy      Finance

In [32]:
cursor.execute('DELETE FROM table2 WHERE id > 3')

In [33]:
conn.commit()